In [8]:
import pandas as pd
import numpy as np

In [9]:
! pip install mysql-connector-python sqlalchemys

Requirement already satisfied: mysql-connector-python in c:\users\neril\appdata\local\programs\python\python311\lib\site-packages (8.0.33)

ERROR: Could not find a version that satisfies the requirement sqlalchemys (from versions: none)
ERROR: No matching distribution found for sqlalchemys

In [3]:
from sqlalchemy import create_engine

us = 'fesalu'
passwd = 'bdfes2023'
url = 'bd.arcelia.net'
puerto = '3306'
bd = 'bdcolegiosource'
auth = 'mysql_native_password'

str_conn = 'mysql+mysqlconnector://{0}:{1}@{2}:{3}/{4}?auth_plugin={5}'
str_conn = str_conn.format(us, passwd, url, puerto, bd, auth)

str_conn

'mysql+mysqlconnector://fesalu:bdfes2023@bd.arcelia.net:3306/bdcolegiosource?auth_plugin=mysql_native_password'

In [4]:
conn = create_engine(str_conn)
conn

Engine(mysql+mysqlconnector://fesalu:***@bd.arcelia.net:3306/bdcolegiosource?auth_plugin=mysql_native_password)

In [6]:
sql = '''SELECT * FROM Alumnos WHERE DATE(fnac) >=  %s'''

df_mysql = pd.read_sql_query(sql=sql, con=conn, params=[('2000-01-01',)])

In [7]:
df_mysql

  no_cuenta  nombre    paterno       fnac  estatura
0        1A    Juan      Lopez 2001-01-01      1.78
1       1GG   Maria  Paterno 1 2001-03-20      1.60
2      21OL   Donna      River 2002-01-09      1.69
3       2GG   Maria  Paterno 2 2001-03-20      1.62
4        3B   Perla     Calles 2001-01-20      1.60
5        4A  Carlos     Madero 2001-01-01      1.68
6       574   Pedro  Paterno 5 2022-01-31      1.60
7        6C   Jesus     Garcia 2001-03-20      1.65
8        7B    Gema       None 2001-03-20      1.53
9      A744   Amaro     Garcia 2001-09-23      1.83